/** 
 * =======================================================================
 * 
 * 【日時タスク】
 *　・実行時間は4-5時
 * 
 * =======================================================================
 **/

function dayly_Task() {
  // ----- 作業依頼の登録 --------------------------------------------------
  Logger.log("▽作業依頼の登録を行います")
  Gen_WorkRequestRegistration()
  Logger.log("〇作業依頼の登録が完了しました")

  SpreadsheetApp.flush();  // 強制コミット

  // -----  登録確認 ------------------------------------------------------
  CheckRequest()

  // ----- SV案件管理表の日時タスク -----------------------------------------
  Logger.log("▽SV案件管理表の登録を行います")
  SV_dailyTask()
  Logger.log("〇SV案件管理表の追加登録が完了しました")

  // ----- CL案件管理表の日時タスク -----------------------------------------
  Logger.log("▽CL案件管理表の登録を行います")
  CL_dailyTask()
  Logger.log("〇CL案件管理表の追加登録が完了しました")

  // ----- スケジュール更新 ------------------------------------------------
  Logger.log("▽スケジュールの更新します")
  SC_Task()
  Logger.log("〇スケジュールの更新が完了しました")
}
