/** 
 * =======================================================================
 * 
 * ・CL案件のクロージング
 * ・対応外の案件を非表示にする
 * ・更新日が翌日以降であればリセットする
 * 
 * ======================================================================== 
 **/ 

function CL_dailyTask() {

  // ----- HyperLink挿入 --------------------------------------------------
  CL_InsertLinks()
  
  // ----- 作業フォルダ作成 -------------------------------------------------
  //CL_AcreateWorkFolders()

  // ----- 作業工数追記 -----------------------------------------------------
  CL_TotalWork()

  // ----- 作業報告書作成 ----------------------------------------------------
  //CL_createWorkReport()

  // ***CL案件の更新日について、翌日以降の値はクリア
  tommorow.setHours(0, 0, 0, 0); // 時刻をリセットして日付のみ比較
  
  const rangeA = sheetCL.getRange(1, 1, lastRowCL, 1); // A列のすべてのデータを取得
  const values = rangeA.getValues(); // 取得したデータを配列として取得
  
  // 値が今日以降の日付であればそのセルの値をクリア
  for (let i = 0; i < values.length; i++) {
    if (CLCOL_UPDATE_DATE > tommorow) {
      sheetCL.getRange(i + 1, 1).clearContent(); // 行番号は1から始まるため、インデックスに1を足す
    }
  }
}
